[
  {
    "id": 1,
    "title": "UniClean",
    "description": "Academic project",
    "details": "- Developed a full-stack cross-platform mobile application as a final year project to address menstrual health issues and period poverty. <br/> - Implemented a Long Short-Term Memory (LSTM) model to predict the length of the luteal phase in regular and irregular menstrual cycles, enabling timely medical attention to prevent miscarriages and infertility and implementing a real-time trained medical chat assistant specifically for such issues. <br/> - Integrated a personalised reminder system that notifies members of academic institutions about the availability of free period products on campuses, based on their individual menstrual cycles, to overcome period product poverty.",
    "techStack": [
      "React Native",
      "Flask",
      "Tensorflow",
      "Supabase",
      "Notify",
      "Botpress"
    ],
    "url": "https://github.com/rohailramesh/UniClean_FYP",
    "image": "/uniclean.png"
  },
  {
    "id": 2,
    "title": "Flatify",
    "description": "Academic project",
    "details": "- Led a team of seven in developing a cross-platform application for a global corporation to streamline the process of locating accommodations for their consultants. <br/> - Designed and implemented features that allowed consultants to easily search for and connect with suitable accommodations, fostering meaningful connections among the company's global workforce.  <br/> - Utilized agile methodologies throughout the 12-week project to adapt dynamically to emerging requirements, ensuring collaboration, transparency, and innovation within the team. <br/> - Awarded the Best Software Engineering Award for successfully delivering a user-centered solution that enhanced the company's operational efficiency and consultant experience.",
    "techStack": [
      "React Native",
      "Next.js",
      "Redis",
      "Supabase",
      "Framer Motion",
      " Google Places API",
      "Chakra UI"
    ],
    "url": "https://github.com/rohailramesh/flat-finder",

    "image": "/flatify.jpeg"
  },
  {
    "id": 3,
    "title": "Arang",
    "description": "Personal project",
    "details": "The app offers a dynamic music experience where users can listen to their favorite tracks, seamlessly navigate through songs with the ability to play the next or previous track, and adjust the volume with a convenient slider. The admin dashboard provides an intuitive platform for creating and managing albums and songs, streamlining content management. Additionally, a real-time chat app is integrated with Arang, allowing users to communicate while enjoying their music. Users can easily check their online or offline status and see what other listeners are enjoying in real-time, enhancing social interaction. For deeper insights, the app also includes an analytics page that aggregates data, offering a comprehensive view of user activity and trends.",
    "techStack": [
      "MERN Stack",
      "Clerk",
      "Cloudinary",
      "Socket.io",
      "Zustand",
      "Shadcn UI",
      "Axios",
      "Typescript"
    ],
    "url": "https://github.com/rohailramesh/arang-mern-app",
    "image": "/arang_homepage.png"
  },

  {
    "id": 4,
    "title": "Converse",
    "description": "Personal project",
    "details": "- Built a real-time messaging web application using the MERN stack with a focus on WebSockets for instant communication and JWT for secure authentication and authorization. <br/> - Implemented features such as online user status, real-time messaging with Socket.io, and robust state management using Zustand, ensuring seamless user interaction. <br/> - Designed a modern and responsive user interface using TailwindCSS and Daisy UI, offering an intuitive and visually appealing user experience. <br/> - Developed server-side and client-side error handling mechanisms for reliable performance and a smooth user experience.",
    "techStack": [
      "MERN Stack",
      "Socket.io",
      "JWT",
      "Zustand",
      "TailwindCSS",
      "Daisy UI"
    ],
    "url": "https://github.com/rohailramesh/Converse",
    "image": "/converse-1.png"
  },
  {
    "id": 5,
    "title": "Barter",
    "description": "Personal project",
    "details": "- Built a feature-rich e-commerce platform with core shopping functionalities, including product and category management, a shopping cart, and checkout using Stripe integration. <br/> - Developed a robust authentication system with JWT (Access/Refresh Tokens) to secure user sessions and role-based access. <br/> - Implemented performance optimizations with Redis caching for faster load times and enhanced user experience. <br/> - Designed a modern, responsive UI using TailwindCSS for a seamless shopping experience. <br/> - Introduced sales analytics and an admin dashboard for effective product and user management.",
    "techStack": [
      "MongoDB",
      "Express.js",
      "React.js",
      "Node.js",
      "Stripe",
      "JWT",
      "Redis",
      "TailwindCSS"
    ],
    "url": "https://github.com/rohailramesh/barter-mern-app",
    "image": "/barter-1.png"
  },

  {
    "id": 6,
    "title": "HART News",
    "description": "Academic project",
    "details": "- Led a web-based news application project for a final year module on Web Programming, utilising Django for a scalable backend architecture and MySQL for efficient data storage and retrieval; integrated RESTful APIs to fetch and display news articles in JSON format dynamically. <br/> - Implemented secure user authentication and session management using web cookies and tokens, enhancing web security and user experience; <br/> - Deployed the application on OpenShift for scalable cloud hosting and used AWS S3 to host multimedia content, optimising storage and enhancing content delivery for a global user base.",
    "techStack": [
      "Django",
      "MySQL",
      "Bootstrap",
      "REST API",
      "OpenShift",
      "AWS S3"
    ],
    "url": "https://github.com/rohailramesh/ECS639U-Web-Programming-2023-24-CW3",
    "image": "/newsapp.png"
  },
  {
    "id": 7,
    "title": "Subspace",
    "description": "Personal project",
    "details": "- Developed a full-stack, cross-platform application as a personal project to streamline the management of online subscriptions, providing a centralised solution with timely reminders and an interactive dashboard. <br/> - incorporated real-time features, such as push notifications and automatic subscription renewal reminders, to enhance user experience and prevent unintended lapses or cancellations. <br/> - Implemented a robust backend using Supabase that ensures data privacy, security, and compliance.",
    "techStack": ["React Native", "Supabase"],
    "url": "https://github.com/rohailramesh/Subspace",
    "image": "/subspace.png"
  }
]
