[
  {
    "id": 1,
    "title": "UniClean",
    "description": "Academic project",
    "details": "- Developed a full-stack cross-platform mobile application as a final year project to address menstrual health issues and period poverty. <br/> - Implemented a Long Short-Term Memory (LSTM) model to predict the length of the luteal phase in regular and irregular menstrual cycles, enabling timely medical attention to prevent miscarriages and infertility and implementing a real-time trained medical chat assistant specifically for such issues. <br/> - Integrated a personalised reminder system that notifies members of academic institutions about the availability of free period products on campuses, based on their individual menstrual cycles, to overcome period product poverty.",
    "techStack": [
      "React Native",
      "Flask",
      "Tensorflow",
      "Supabase",
      "Notify",
      "Botpress"
    ],
    "url": "https://github.com/rohailramesh/UniClean_FYP",
    "image": "/uniclean.png"
  },
  {
    "id": 2,
    "title": "Subspace",
    "description": "Personal project",
    "details": "- Developed a full-stack, cross-platform application as a personal project to streamline the management of online subscriptions, providing a centralised solution with timely reminders and an interactive dashboard. <br/> - incorporated real-time features, such as push notifications and automatic subscription renewal reminders, to enhance user experience and prevent unintended lapses or cancellations. <br/> - Implemented a robust backend using Supabase that ensures data privacy, security, and compliance.",
    "techStack": ["React Native", "Supabase"],
    "url": "https://github.com/rohailramesh/Subspace",
    "image": "/subspace.png"
  },
  {
    "id": 3,
    "title": "Flatify",
    "description": "Academic project",
    "details": "- Led a team of seven in developing a cross-platform application for a global corporation to streamline the process of locating accommodations for their consultants. <br/> - Designed and implemented features that allowed consultants to easily search for and connect with suitable accommodations, fostering meaningful connections among the company's global workforce.  <br/> - Utilized agile methodologies throughout the 12-week project to adapt dynamically to emerging requirements, ensuring collaboration, transparency, and innovation within the team. <br/> - Awarded the Best Software Engineering Award for successfully delivering a user-centered solution that enhanced the company's operational efficiency and consultant experience.",
    "techStack": [
      "React Native",
      "Next.js",
      "Redis",
      "Supabase",
      "Framer Motion",
      " Google Places API",
      "Chakra UI"
    ],
    "url": "https://github.com/rohailramesh/flat-finder",

    "image": "/flatify.jpeg"
  },
  {
    "id": 4,
    "title": "Ro-Reviews",
    "description": "Personal project",
    "details": "- Developed a user-friendly website as a personal project using Next.js for book enthusiasts to track and manage their book collections, featuring a clean and modern design that makes it easy to navigate and organise books. <br/> - Implemented a robust note-taking system that allows users to add, edit, and delete notes for each book, providing a seamless experience for users to record their thoughts, opinions, and insights about the books they read. <br/> - Utilised Next.js's server-side rendering capabilities to ensure fast and efficient loading of the website, ensuring a smooth user experience for users who want to quickly access and manage their book collections.",
    "techStack": ["Next.js", "Supabase", "Google Books API"],
    "url": "https://github.com/rohailramesh/BookLand",
    "image": "/roreviews.png"
  },
  {
    "id": 5,
    "title": "RoamCast",
    "description": "Academic project",
    "details": "- Collaborated on a graphical user interface application as a group project in 2nd year, designed to help tourists plan their trips based on real-time weather forecasts and access all the necessary information related to their destination in one centralised platform. <br/> - Implemented a user-friendly interface that allows tourists to easily search for their desired destination, view detailed weather forecasts, and access relevant information such as local attractions, restaurants, transportation options, and accommodation recommendations. <br/> - Focused on Human-Computer Interaction principle whilst enhancing the application's usability, intuitive navigation, and overall user experience.",
    "techStack": ["React.js", "WeatherAPI", "Bootstrap"],
    "url": "https://github.com/rohailramesh/GUI_Weather_App",
    "image": "/roamcast.png"
  },
  {
    "id": 6,
    "title": "HART News",
    "description": "Academic project",
    "details": "- Led a web-based news application project for a final year module on Web Programming, utilising Django for a scalable backend architecture and MySQL for efficient data storage and retrieval; integrated RESTful APIs to fetch and display news articles in JSON format dynamically. <br/> - Implemented secure user authentication and session management using web cookies and tokens, enhancing web security and user experience; <br/> - Deployed the application on OpenShift for scalable cloud hosting and used AWS S3 to host multimedia content, optimising storage and enhancing content delivery for a global user base.",
    "techStack": [
      "Django",
      "MySQL",
      "Bootstrap",
      "REST API",
      "OpenShift",
      "AWS S3"
    ],
    "url": "https://github.com/rohailramesh/ECS639U-Web-Programming-2023-24-CW3",
    "image": "/newsapp.png"
  }
]
